In [2]:
import pandas as pd
import chardet
import mysql.connector as db
import sqlalchemy
from sqlalchemy import create_engine

In [7]:
mydb = db.connect(
    host="localhost",
    user="root",
    password="root",
    database="global_electronics"
)
mycursor = mydb.cursor(buffered=True)

mycursor.execute("USE global_electronics")

-------------------------------

1) Most sold Item Over the years with SOLD QTY and OVERALL PROFIT?

In [8]:
query1 = """SELECT 
    o.ProductKey,
    p.ProductName, 
    SUM(o.Quantity) AS TotalQuantity,
    FORMAT(SUM((p.UnitPriceUSD - p.UnitCostUSD) * o.Quantity), 2) AS 'Profit USD'
FROM 
    orders o
JOIN 
    Products p ON o.ProductKey = p.ProductKey
GROUP BY 
    p.ProductName, o.ProductKey
ORDER BY 
    TotalQuantity DESC
LIMIT 10;"""

mycursor.execute(query1)
df_1 = pd.DataFrame(mycursor.fetchall(),columns= ['Product Id', 'Product Name', 'Total QTY Sold','Total Profit USD'])
#df_1['Total_amount'] = df_1['Total_amount'].round(2)
df_1.index += 1
df_1

,Product Id,Product Name,Total QTY Sold,Total Profit USD
1,444,WWI Desktop PC2.33 X2330 Black,550,"337,985.99"
2,458,WWI Desktop PC1.80 E1800 White,538,"60,627.22"
3,434,Adventure Works Desktop PC2.30 MD230 White,521,"168,564.34"
4,424,Adventure Works Desktop PC1.60 ED160 Black,521,"68,938.72"
5,425,Adventure Works Desktop PC1.80 ED180 Black,520,"94,052.40"
6,423,Adventure Works Desktop PC2.30 MD230 Black,514,"166,299.56"
7,446,WWI Desktop PC1.60 E1600 Black,509,"54,875.29"
8,440,WWI Desktop PC1.60 E1600 Silver,507,"54,659.67"
9,435,Adventure Works Desktop PC1.60 ED160 White,505,"66,821.60"
10,448,WWI Desktop PC1.80 E1801 Black,505,"66,811.49"

----------------------------

2) Top 5 stores wich perform good sales every year

In [52]:
query2 = """SELECT 
    storekey, 
    YEAR(orderdate) AS year,
    FORMAT(SUM(total_price), 2) AS total_sales
FROM 
    (
        SELECT 
            o.storekey,
            SUM(p.UnitPriceUSD * o.Quantity) AS total_price,
            o.orderdate
        FROM 
            orders o
        JOIN 
            Products p ON o.ProductKey = p.ProductKey
        GROUP BY 
            o.storekey, o.ProductKey, o.orderdate
    ) AS subquery
GROUP BY 
    storekey, YEAR(orderdate)
ORDER BY 
    storekey;"""

mycursor.execute(query2)
df_2 = pd.DataFrame(mycursor.fetchall(),columns= ['Store_Id', 'Year', 'Total_Sales'])
# Pivot the DataFrame
df_2_final = df_2.pivot(index='Store_Id', columns='Year', values='Total_Sales')

# Reset the index to make 'Store_Id' a column again
df_2_final = df_2_final.reset_index()

# Rename the columns (optional, the pivot table will have the correct names by default)
df_2_final.columns.name = None  # Remove the name of the columns axis
df_2_final = df_2_final.fillna(0.0)

df_2_final.index += 1
# Display the resulting DataFrame
df_2_final

,Store_Id,2016,2017,2018,2019,2020,2021
1,0,"1,169,315.86","1,388,497.44","2,582,287.13","3,908,495.70","2,069,950.90","285,777.60"
2,1,"16,325.43","24,980.24","54,196.31","83,345.18","59,547.84","4,634.93"
3,2,"15,175.99",0.0,0.0,0.0,0.0,0.0
4,4,"33,116.81","72,686.25","116,030.59","181,319.47","34,941.02","4,380.88"
5,5,"127,675.35","89,379.16","235,314.03","277,555.37","115,533.80","14,220.48"
6,6,"81,516.32","94,777.30","103,192.69","146,542.80","111,147.00","1,605.83"
7,8,"179,337.58","195,369.79","323,814.43","344,169.46","160,783.21","28,751.46"
8,9,"212,341.79","183,846.48","281,824.16","433,627.51","194,642.34","29,867.78"
9,10,"117,234.51","126,977.82","241,664.53","351,148.61","196,229.14","9,931.19"
10,12,"14,444.58","16,674.03","40,924.45","53,193.33","54,126.12","3,728.53"
11,13,"15,351.28","29,112.88","18,004.80","46,260.47","37,988.94","4,206.75"
12,14,"25,309.45","19,906.79","14,731.09","25,694.46","19,755.19",317.07
13,15,"16,537.02","32,117.84","30,300.60","75,094.30","41,970.26","9,099.65"
14,16,"32,709.74","12,967.85","36,073.90","62,656.76","54,601.44",0.0
15,17,"9,082.59","28,552.97","43,035.55","39,113.11","34,240.51","5,582.77"
16,18,"36,072.24","27,063.16","47,418.70","89,756.71","21,675.38","4,092.69"
17,19,"106,641.16","68,375.97","156,110.16","162,502.45","63,005.84","19,939.35"
18,20,"50,594.00","77,514.78","171,178.53","89,306.76",0.0,0.0
19,21,0.0,0.0,"81,924.55","236,119.93","79,077.78","5,151.86"
20,22,"58,954.46","80,891.14","154,785.82","271,521.30","77,482.26","9,349.88"
21,23,"64,665.77","80,502.26","171,827.08","190,784.22","102,549.27","4,711.99"
22,24,"170,773.45","53,581.56","140,112.73","184,961.16","115,336.70","8,794.35"
23,26,0.0,0.0,0.0,"170,160.62","97,216.75","12,397.19"
24,27,"120,044.53","93,689.51","140,976.28","214,439.51","88,326.31",0.0
25,28,"114,610.12","72,499.37",0.0,0.0,0.0,0.0
26,29,"160,646.67","123,976.41","220,526.18","278,462.89","121,895.59","8,348.61"
27,30,"110,245.53","125,603.06","293,186.19","283,358.34","138,923.94","6,803.91"
28,31,"39,500.71","45,040.00","107,343.49","108,981.54","52,753.88","3,510.53"
29,32,"57,556.57","17,557.77","88,806.90","145,191.95","63,065.97","10,415.94"
30,33,"77,752.96","69,724.48","54,833.77","132,373.85","80,749.14","1,424.79"
31,34,"44,380.23","57,450.25","142,921.22","129,759.50","53,751.32","6,497.72"
32,36,"97,084.37","121,273.31","181,455.37","286,993.68","130,175.95","20,684.51"
33,37,"165,875.91","124,706.38","217,973.48","204,682.65","118,089.63","10,666.21"
34,38,"171,031.38","145,970.49","241,617.69","285,114.75","151,441.80",137.00
35,39,"76,948.42","141,321.26","178,466.39","338,792.19","142,362.65","16,228.25"
36,40,"108,337.62","155,329.38","214,953.93","289,201.17","126,625.84","17,148.31"
37,41,"110,126.16","159,489.14","113,438.73",0.0,0.0,0.0
38,42,"141,458.05","134,489.33","176,987.04","296,544.55","129,894.15","6,652.66"
39,43,"116,426.33","179,887.26","190,943.57","469,094.42","263,444.43","30,459.13"
40,44,"138,511.58","186,022.04","292,706.64","374,484.08","206,960.59","18,172.80"
41,45,"123,419.43","187,281.89","294,591.27","407,442.50","276,715.11","29,337.72"
42,47,"141,565.13","124,621.77","231,775.45","410,915.21","205,304.34","16,561.04"
43,48,"174,483.51","156,299.59","224,629.02","321,799.10","168,947.73","12,109.55"
44,49,0.0,0.0,"249,946.77","472,079.90","180,614.20","32,927.68"
45,50,"136,377.78","216,552.01","351,674.60","373,931.65","299,135.14","17,066.88"
46,51,"156,676.19","151,226.60","258,668.82","328,628.79","225,794.43","9,597.48"
47,53,"121,040.68","164,238.03","304,121.80","330,496.85","238,202.13","35,821.65"
48,54,"175,755.08","228,765.11","281,474.12","451,311.90","231,295.43","15,794.60"
49,55,"211,047.13","205,908.29","271,513.51","445,442.20","233,389.62","50,584.66"
50,56,"152,169.97","188,615.65","288,229.53","366,900.74","190,652.46","20,685.38"
51,57,"154,503.32","158,065.18","325,855.14","452,645.11","224,025.18","10,517.96"
52,59,"173,914.85","180,560.40","296,862.56","438,027.03","189,830.74","23,076.86"
53,61,"171,320.71","138,371.67","308,065.67","434,038.17","207,979.48","45,908.73"
54,62,0.0,0.0,"152,838.80","321,125.04","157,563.76","34,775.05"
55,63,"182,842.52","135,619.20","245,355.72","256,113.60",0.0,0.0
56,64,"190,491.31","182,561.59","257,392.19","369,857.81","239,205.71","19,842.37"
57,65,"136,930.97","205,171.80","269,429.20","377,773.44","210,601.92","25,133.05"
58,66,"140,542.46","139,758.34","274,647.79","445,048.69","205,111.88","15,855.22"

---------------------------

3) SORT OUT THE CUSTOMER AGE ON PURCHASING

In [53]:
query3 = """SELECT
    age_bucket,
    COUNT(*) AS count
FROM (
    SELECT
        c.CustomerKey,
        o.Orderdate,
        c.birthday,
        CASE
            WHEN YEAR(STR_TO_DATE(o.Orderdate, '%Y-%m-%d')) - YEAR(STR_TO_DATE(c.birthday, '%Y-%m-%d')) < 18 THEN '<=18'
            WHEN YEAR(STR_TO_DATE(o.Orderdate, '%Y-%m-%d')) - YEAR(STR_TO_DATE(c.birthday, '%Y-%m-%d')) BETWEEN 18 AND 24 THEN '18-24'
            WHEN YEAR(STR_TO_DATE(o.Orderdate, '%Y-%m-%d')) - YEAR(STR_TO_DATE(c.birthday, '%Y-%m-%d')) BETWEEN 25 AND 34 THEN '25-34'
            WHEN YEAR(STR_TO_DATE(o.Orderdate, '%Y-%m-%d')) - YEAR(STR_TO_DATE(c.birthday, '%Y-%m-%d')) BETWEEN 35 AND 44 THEN '35-44'
            WHEN YEAR(STR_TO_DATE(o.Orderdate, '%Y-%m-%d')) - YEAR(STR_TO_DATE(c.birthday, '%Y-%m-%d')) BETWEEN 45 AND 54 THEN '45-54'
            WHEN YEAR(STR_TO_DATE(o.Orderdate, '%Y-%m-%d')) - YEAR(STR_TO_DATE(c.birthday, '%Y-%m-%d')) BETWEEN 55 AND 64 THEN '55-64'
            ELSE '>65'
        END AS age_bucket
    FROM CUSTOMERS AS c
    JOIN ORDERS o ON c.CustomerKey = o.CustomerKey
) AS age_groups
GROUP BY age_bucket;"""

mycursor.execute(query3)
df_3 = pd.DataFrame(mycursor.fetchall(),columns= ['AGE RANGE', 'COUNT'])

df_3.index += 1
df_3

  AGE RANGE  COUNT
1     45-54   9420
2     18-24   6561
3     35-44   9371
4       >65  17831
5     25-34   9386
6     55-64   9335
7      <=18    980

-----------------------------

4) GENDER COUNT

In [55]:
query4 = """SELECT gender, COUNT(*) AS Count_gender
FROM customers
GROUP BY gender;"""

mycursor.execute(query4)
df_4 = pd.DataFrame(mycursor.fetchall(),columns= ['GENDER', 'COUNT'])

df_4.index += 1
df_4

   GENDER  COUNT
1  Female   7518
2    Male   7748

---------------------------

5) CUSTOMER COUNT COUNTRY WISE

In [59]:
query5 = """SELECT 
    continent,country,
    COUNT(CustomerKey) AS customer_count
FROM 
    CUSTOMERS
GROUP BY 
    continent,country
ORDER BY 
    customer_count DESC"""

mycursor.execute(query5)
df_5 = pd.DataFrame(mycursor.fetchall(),columns= ['CONTINENT', 'COUNTRY','CUSTOMER COUNT'])

df_5.index += 1
df_5

       CONTINENT         COUNTRY  CUSTOMER COUNT
1  North America   United States            6828
2         Europe  United Kingdom            1944
3  North America          Canada            1553
4         Europe         Germany            1473
5      Australia       Australia            1420
6         Europe     Netherlands             733
7         Europe          France             670
8         Europe           Italy             645

-------------------------------

6) MOST SOLD PRODUCTS CATAGORY WISE

In [60]:
query6 = """SELECT 
    p.Category,
    p.Subcategory,
    SUM(o.Quantity) AS qty
FROM 
    orders o
JOIN 
    Products p ON o.ProductKey = p.ProductKey
GROUP BY 
    p.Category, p.Subcategory
ORDER BY 
    qty DESC
LIMIT 10;"""

mycursor.execute(query6)
df_6 = pd.DataFrame(mycursor.fetchall(),columns= ['Category', 'Subcategory','Total QTY Sold'])

df_6.index += 1
df_6

                         Category           Subcategory Total QTY Sold
1   Music, Movies and Audio Books             Movie DVD          28802
2                       Computers              Desktops          20626
3                           Audio  Bluetooth Headphones          13653
4                  Games and Toys        Download Games          11547
5                  Games and Toys           Boxed Games          11044
6                     Cell phones   Touch Screen Phones          10630
7                     Cell phones   Smart phones & PDAs          10077
8                           Audio         Recording Pen           6617
9                    TV and Video           Televisions           5625
10                    Cell phones  Home & Office Phones           5432

----------------------------

7) LEAST SOLD PRODUCTS CATOGORY WISE

In [61]:
query7 = """SELECT 
    p.Category,
    p.Subcategory,
    SUM(o.Quantity) AS qty
FROM 
    orders o
JOIN 
    Products p ON o.ProductKey = p.ProductKey
GROUP BY 
    p.Category, p.Subcategory
ORDER BY 
    qty ASC
LIMIT 10;"""

mycursor.execute(query7)
df_7 = pd.DataFrame(mycursor.fetchall(),columns= ['Category', 'Subcategory','Total QTY Sold'])

df_7.index += 1
df_7

           Category          Subcategory Total QTY Sold
1   Home Appliances     Air Conditioners            884
2   Home Appliances                Lamps           1164
3   Home Appliances     Washers & Dryers           1180
4   Home Appliances                 Fans           1241
5      TV and Video            Car Video           1363
6      TV and Video  Home Theater System           1375
7   Home Appliances      Coffee Machines           2295
8   Home Appliances        Refrigerators           2324
9      TV and Video            VCD & DVD           2873
10            Audio              MP4&MP3           3220

----------------------

8) comparing online sales and physical store sales

In [68]:
query8 = """SELECT
    CASE
        WHEN o.storekey = 0 THEN 'ONLINE STORE'
        ELSE 'PHYSICAL STORES'
    END AS store_group,
    SUM(o.Quantity) AS total_quantity,
    FORMAT(SUM(p.UnitPriceUSD * o.Quantity),2) AS total_sales
FROM
    orders o
JOIN
    Products p ON o.ProductKey = p.ProductKey
GROUP BY
    store_group
ORDER BY
    store_group;"""

mycursor.execute(query8)
df_8 = pd.DataFrame(mycursor.fetchall(),columns= ['STORE TYPE', 'Total QTY Sold', 'TOTAL SALES USD'])

df_8.index += 1
df_8

        STORE TYPE Total QTY Sold TOTAL SALES USD
1     ONLINE STORE          41311   11,404,324.62
2  PHYSICAL STORES         156446   44,351,154.91

In [49]:
df_2_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Store_Id  58 non-null     int64
 1   2016      58 non-null     object
 2   2017      58 non-null     object
 3   2018      58 non-null     object
 4   2019      58 non-null     object
 5   2020      58 non-null     object
 6   2021      58 non-null     object
dtypes: int64(1), object(6)
memory usage: 3.3+ KB

In [11]:
df_2['Year'].unique()

[np.int64(2016),
 np.int64(2017),
 np.int64(2018),
 np.int64(2019),
 np.int64(2020),
 np.int64(2021)]

In [ ]:
query = "SELECT video_info.Views as Views, video_info.Title, channel_info.Channel_Name FROM video_info join channel_info on channel_info.Channel_Id = video_info.Channel_Id ORDER BY Views desc limit 10;"
        result_3 = get_cursor(query)
        df3 = pd.DataFrame(result_3, columns=['Video Views','Video Name','Channel Name']).reset_index(drop=True)
        df3.index += 1
        st.dataframe(df3)